================================================================================
Empty Enum definition
================================================================================

Enum enum_name {

}

--------------------------------------------------------------------------------

(document
  (enum
    (enum_name)))

================================================================================
Empty enum definition
================================================================================

enum enum_name {

}

--------------------------------------------------------------------------------

(document
  (enum
    (enum_name)))

================================================================================
Enum with identifiers
================================================================================

enum enum_name {
  foo
  bar
  baz
}

--------------------------------------------------------------------------------

(document
  (enum
    (enum_name)
    (variant)
    (variant)
    (variant)))

================================================================================
Enum with strings
================================================================================

enum enum_name {
  "foo"
  "bar"
  "baz"
}

--------------------------------------------------------------------------------

(document
  (enum
    (enum_name)
    (variant)
    (variant)
    (variant)))

================================================================================
Enum with notes
================================================================================

enum enum_name {
  foo [note: "foobar"]
  bar
  baz [note: "foobaz"]
}

--------------------------------------------------------------------------------

(document
  (enum
    (enum_name)
    (variant
      (variant_notes
        (note
          (note_text))))
    (variant)
    (variant
      (variant_notes
        (note
          (note_text))))))
