================================================================================
Empty Enum definition
================================================================================

Enum enum_name {

}

--------------------------------------------------------------------------------

(schema
  (enum
    (enum_name)))

================================================================================
Empty enum definition
================================================================================

enum enum_name {

}

--------------------------------------------------------------------------------

(schema
  (enum
    (enum_name)))

================================================================================
Enum with identifiers
================================================================================

enum enum_name {
  foo
  bar
  baz
}

--------------------------------------------------------------------------------

(schema
  (enum
    (enum_name)
    (variant)
    (variant)
    (variant)))

================================================================================
Enum with strings
================================================================================

enum enum_name {
  "foo"
  "bar"
  "baz"
}

--------------------------------------------------------------------------------

(schema
  (enum
    (enum_name)
    (variant
      (string))
    (variant
      (string))
    (variant
      (string))))

================================================================================
Enum with notes
================================================================================

enum enum_name {
  foo [note: "foobar"]
  bar
  baz [note: "foobaz"]
}

--------------------------------------------------------------------------------

(schema
  (enum
    (enum_name)
    (variant
      (variant_notes
        (note
          (note_text
            (string)))))
    (variant)
    (variant
      (variant_notes
        (note
          (note_text
            (string)))))))
