================================================================================
Empty shortform Note definition
================================================================================

Note:

--------------------------------------------------------------------------------

(document
  (note))

================================================================================
Empty longform Note definition
================================================================================

Note {

}

--------------------------------------------------------------------------------

(document
  (note))

================================================================================
Empty longform Note definition with name
================================================================================

Note note_name {

}

--------------------------------------------------------------------------------

(document
  (note
    (note_name)))

================================================================================
Empty shortform note definition
================================================================================

note:

--------------------------------------------------------------------------------

(document
  (note))

================================================================================
Empty longform note definition
================================================================================

note {

}

--------------------------------------------------------------------------------

(document
  (note))

================================================================================
Empty longform note definition with name
================================================================================

note name {

}

--------------------------------------------------------------------------------

(document
  (note
    (note_name)))
