================================================================================
Empty shortform Note definition
================================================================================

Note:

--------------------------------------------------------------------------------

(schema
  (note))

================================================================================
Empty longform Note definition
================================================================================

Note {

}

--------------------------------------------------------------------------------

(schema
  (note))

================================================================================
Empty longform Note definition with name
================================================================================

Note note_name {

}

--------------------------------------------------------------------------------

(schema
  (note
    (note_name)))

================================================================================
Empty shortform note definition
================================================================================

note:

--------------------------------------------------------------------------------

(schema
  (note))

================================================================================
Empty longform note definition
================================================================================

note {

}

--------------------------------------------------------------------------------

(schema
  (note))

================================================================================
Empty longform note definition with name
================================================================================

note name {

}

--------------------------------------------------------------------------------

(schema
  (note
    (note_name)))

================================================================================
Shortform Note definition
================================================================================

Note: "hello world"

--------------------------------------------------------------------------------

(schema
  (note
    (note_text)))

================================================================================
Longform Note definition
================================================================================

Note {
  "hello world"
}

--------------------------------------------------------------------------------

(schema
  (note
    (note_text)))

================================================================================
Longform Note definition with name
================================================================================

Note note_name {
  "hello world"
}

--------------------------------------------------------------------------------

(schema
  (note
    (note_name)
    (note_text)))

================================================================================
Shortform note definition
================================================================================

note: "hello world"

--------------------------------------------------------------------------------

(schema
  (note
    (note_text)))

================================================================================
Longform note definition
================================================================================

note {
  "hello world"
}

--------------------------------------------------------------------------------

(schema
  (note
    (note_text)))

================================================================================
Longform note definition with name
================================================================================

note name {
  "hello world"
}

--------------------------------------------------------------------------------

(schema
  (note
    (note_name)
    (note_text)))

================================================================================
Shortform multiline Note definition
================================================================================

Note: '''
  hello world
'''

--------------------------------------------------------------------------------

(schema
  (note
    (note_text)))

================================================================================
Longform Note definition
================================================================================

Note {
  '''
  hello world
  '''
}

--------------------------------------------------------------------------------

(schema
  (note
    (note_text)))

================================================================================
Longform Note definition with name
================================================================================

Note note_name {
  '''
  hello world
  '''
}

--------------------------------------------------------------------------------

(schema
  (note
    (note_name)
    (note_text)))

================================================================================
Shortform note definition
================================================================================

note: '''
  hello world
'''

--------------------------------------------------------------------------------

(schema
  (note
    (note_text)))

================================================================================
Longform note definition
================================================================================

note {
  '''
  hello world
  '''
}

--------------------------------------------------------------------------------

(schema
  (note
    (note_text)))

================================================================================
Longform note definition with name
================================================================================

note name {
  '''
  hello world
  '''
}

--------------------------------------------------------------------------------

(schema
  (note
    (note_name)
    (note_text)))
