================================================================================
Empty shortform Ref definition
================================================================================

Ref:

--------------------------------------------------------------------------------

(document
  (reference))

================================================================================
Empty shortform Ref definition with name
================================================================================

Ref name:

--------------------------------------------------------------------------------

(document
  (reference
    (reference_name)))

================================================================================
Empty longform Ref definition
================================================================================

Ref {

}

--------------------------------------------------------------------------------

(document
  (reference))

================================================================================
Empty longform Ref definition with name
================================================================================

Ref name {

}

--------------------------------------------------------------------------------

(document
  (reference
    (reference_name)))

================================================================================
Empty shortform ref definition
================================================================================

ref:

--------------------------------------------------------------------------------

(document
  (reference))

================================================================================
Empty shortform ref definition with name
================================================================================

ref name:

--------------------------------------------------------------------------------

(document
  (reference
    (reference_name)))

================================================================================
Empty longform ref definition
================================================================================

ref {

}

--------------------------------------------------------------------------------

(document
  (reference))

================================================================================
Empty longform ref definition with name
================================================================================

ref name {

}

--------------------------------------------------------------------------------

(document
  (reference
    (reference_name)))
